## In this sheet, I have implemented basic pyspark operations like how we can load different types of data file [CSV, JSON, TEXTFILE, PARQUET FILE]. and used various types of delimiter, header, inferschema. And later on we applied various filter operations as well. Also I have implemented the concept of RDD as well.

In [ ]:
!apt-get install openjdk-8-jdk-headless -qq > /dev/null
!wget -q http://archive.apache.org/dist/spark/spark-3.1.1/spark-3.1.1-bin-hadoop3.2.tgz
!tar xf spark-3.1.1-bin-hadoop3.2.tgz
!pip install -q findspark
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-3.1.1-bin-hadoop3.2"
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local[*]").getOrCreate()
spark

In [ ]:
df = spark.createDataFrame([[1,2,3,4],[5,6,7,8]])

In [ ]:

df.show()

+---+---+---+---+
| _1| _2| _3| _4|
+---+---+---+---+
|  1|  2|  3|  4|
|  5|  6|  7|  8|
+---+---+---+---+

In [ ]:
type(df)

pyspark.sql.dataframe.DataFrame

In [ ]:
df = spark.read.format("csv").load("/content/machine-readable-business-employment-data-sep-2023-quarter.csv")

In [ ]:

df.show(5)

+----------------+-------+----------+----------+------+------+---------+--------------------+--------------------+--------------+--------------------+--------------+--------------+--------------+
|             _c0|    _c1|       _c2|       _c3|   _c4|   _c5|      _c6|                 _c7|                 _c8|           _c9|                _c10|          _c11|          _c12|          _c13|
+----------------+-------+----------+----------+------+------+---------+--------------------+--------------------+--------------+--------------------+--------------+--------------+--------------+
|Series_reference| Period|Data_value|Suppressed|STATUS| UNITS|Magnitude|             Subject|               Group|Series_title_1|      Series_title_2|Series_title_3|Series_title_4|Series_title_5|
|     BDCQ.SEA1AA|2011.06|     80078|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2011.09|     78324|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2011.12|     85850|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2012.03|     90743|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
+----------------+-------+----------+----------+------+------+---------+--------------------+--------------------+--------------+--------------------+--------------+--------------+--------------+
only showing top 5 rows

In [ ]:
df = spark.read.format("csv").option("header","true").load("/content/machine-readable-business-employment-data-sep-2023-quarter.csv")

In [ ]:
df.show(5)

+----------------+-------+----------+----------+------+------+---------+--------------------+--------------------+--------------+--------------------+--------------+--------------+--------------+
|Series_reference| Period|Data_value|Suppressed|STATUS| UNITS|Magnitude|             Subject|               Group|Series_title_1|      Series_title_2|Series_title_3|Series_title_4|Series_title_5|
+----------------+-------+----------+----------+------+------+---------+--------------------+--------------------+--------------+--------------------+--------------+--------------+--------------+
|     BDCQ.SEA1AA|2011.06|     80078|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2011.09|     78324|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2011.12|     85850|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2012.03|     90743|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2012.06|     81780|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
+----------------+-------+----------+----------+------+------+---------+--------------------+--------------------+--------------+--------------------+--------------+--------------+--------------+
only showing top 5 rows

In [ ]:
df = spark.read.format("csv").option("header","true").load("/content/machine-readable-business-employment-data-sep-2023-quarter.csv")

In [ ]:

df.show(5)

+----------------+-------+----------+----------+------+------+---------+--------------------+--------------------+--------------+--------------------+--------------+--------------+--------------+
|Series_reference| Period|Data_value|Suppressed|STATUS| UNITS|Magnitude|             Subject|               Group|Series_title_1|      Series_title_2|Series_title_3|Series_title_4|Series_title_5|
+----------------+-------+----------+----------+------+------+---------+--------------------+--------------------+--------------+--------------------+--------------+--------------+--------------+
|     BDCQ.SEA1AA|2011.06|     80078|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2011.09|     78324|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2011.12|     85850|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2012.03|     90743|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
|     BDCQ.SEA1AA|2012.06|     81780|      null|     F|Number|        0|Business Data Col...|Industry by emplo...|   Filled jobs|Agriculture, Fore...|        Actual|          null|          null|
+----------------+-------+----------+----------+------+------+---------+--------------------+--------------------+--------------+--------------------+--------------+--------------+--------------+
only showing top 5 rows

In [ ]:
t_df = spark.read.format("csv").option("delimiter","|").option("header","true").load("/content/sample.txt")

In [ ]:
t_df.show()

+---------+-------+----+
|     Name|Surname|  Id|
+---------+-------+----+
|     Neel| Madhab|6281|
|   Rahuul|  kumar|6262|
|Neelkamal|    Roy|6280|
|    Magar|   Sani|6290|
|  Badshah|      K|6284|
|    Kiran|    Das|6261|
+---------+-------+----+

In [ ]:
t_df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Surname: string (nullable = true)
 |-- Id: string (nullable = true)

In [ ]:
df2 = t_df.withColumn("Name",t_df["Name"] .cast('Varchar(20)')).withColumn("Id",t_df["Id"] .cast('integer'))

In [ ]:
df2.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Surname: string (nullable = true)
 |-- Id: integer (nullable = true)

As you can see, when multiline=false, PySpark reads the entire file as a single JSON object and stores it in a column named _corrupt_record, because the data is not formatted correctly for this setting. This is why it's important to choose the appropriate value for the multiline option based on the structure of your JSON data.

In [ ]:
json_df2 = spark.read.format("JSON").option("MULTILINE",True).load("/content/sample4.json")

In [ ]:
json_df2.show(5)

+--------------------+
|              people|
+--------------------+
|[{28, Joe, male, ...|
+--------------------+

In [ ]:
json_df2 = spark.read.format("JSON").option("MULTILINE",True).load("/content/sample1.json")

In [ ]:
json_df2.show()

+-----+-----+-----+
|color|fruit| size|
+-----+-----+-----+
|  Red|Apple|Large|
+-----+-----+-----+

In [ ]:
from re import MULTILINE
readjson=spark.read.options(MULTILINE=True).json('sample4.json')

In [ ]:
readjson.show()

+---+---------+------+--------+----------+
|age|firstName|gender|lastName|    number|
+---+---------+------+--------+----------+
| 28|      Joe|  male| Jackson|7349282382|
+---+---------+------+--------+----------+

In [ ]:
readjson.printSchema()

root
 |-- age: long (nullable = true)
 |-- firstName: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- lastName: string (nullable = true)
 |-- number: string (nullable = true)

#21 Feburary

In [ ]:
read_df=spark.read.options(Delimiter='|',header='True',inferschema=True).csv('/content/file.csv.txt')
read_df.show()
# OUR DATA IS SEPERATED BY '|' SO THE DELIMITER IS '|'
# HEADER IS TRUE, SO THAT IT WILL TAKE FIRST ROW AS A COLUMN FOR THE DATAFRAME
# INFERSCHEMA IS TRUE, SO IT WILL TAKE THE EXACT DATATYPE WHICH IS PROVIDED BY US. OR ELSE BY DEFAULT EVERYTHING IS STRING

+------------+------------+----+-------+
|Country Name|Country Code|Year|Value  |
+------------+------------+----+-------+
|       India|        In01|2000|     90|
|         USA|        US03|2001|     18|
|       China|        ch07|1999|     78|
|       Japan|       jap82|2005|     45|
|       Saudi|       sau81|2003|     56|
+------------+------------+----+-------+

In [ ]:
read_df.printSchema()

root
 |-- Country Name: string (nullable = true)
 |-- Country Code: string (nullable = true)
 |-- Year: integer (nullable = true)
 |-- Value  : integer (nullable = true)

In [ ]:
read_df.columns
# TO GET ALL THE COLUMNS IN OUR DATAFRAME

['Country Name', 'Country Code', 'Year', 'Value  ']

In [ ]:
read_df.dropDuplicates().show()
# TO DROP THE DUPLICATES FROM THE DATA

+------------+------------+----+-------+
|Country Name|Country Code|Year|Value  |
+------------+------------+----+-------+
|       India|        In01|2000|     90|
|       China|        ch08|1599|     34|
|       China|        ch07|1999|     78|
|       Japan|       jap82|2005|     45|
|       Saudi|       sau81|2003|     56|
|         USA|        US03|2001|     18|
+------------+------------+----+-------+

In [ ]:
# TO GET THE DUPLICATES DATA ONLY
read_df.exceptAll(read_df.distinct()).show()

+------------+------------+----+-------+
|Country Name|Country Code|Year|Value  |
+------------+------------+----+-------+
|       Saudi|       sau81|2003|     56|
|       Saudi|       sau81|2003|     56|
+------------+------------+----+-------+

In [ ]:
from pyspark.sql.functions import col
read_df.filter(col('Country Name') == 'India').show()
# USE FILTER TO GET THE COLUMN 'COUNTRY NAME' WHICH IS 'INDIA' ONLY

+------------+------------+----+-------+
|Country Name|Country Code|Year|Value  |
+------------+------------+----+-------+
|       India|        In01|2000|     90|
+------------+------------+----+-------+

In [ ]:
read_df.filter((col('Country Name') == 'India') | (col('Year') == '2001')).show()
# USE THE FILTER TO GET THE COLUMN WHICH IS 'COUNTRY NAME' OR THE 'YEAR' IS '2001'

+------------+------------+----+-------+
|Country Name|Country Code|Year|Value  |
+------------+------------+----+-------+
|       India|        In01|2000|     90|
|         USA|        US03|2001|     18|
+------------+------------+----+-------+

In [ ]:
#SELECT
read_df.select('Country Code','Value  ').show()

+------------+-------+
|Country Code|Value  |
+------------+-------+
|        In01|     90|
|        US03|     18|
|        ch07|     78|
|       jap82|     45|
|       sau81|     56|
|       sau81|     56|
|       sau81|     56|
|        ch08|     34|
+------------+-------+

In [ ]:
#ORDERBY
read_df.orderBy('Value  ').show()

+------------+------------+----+-------+
|Country Name|Country Code|Year|Value  |
+------------+------------+----+-------+
|         USA|        US03|2001|     18|
|       China|        ch08|1599|     34|
|       Japan|       jap82|2005|     45|
|       Saudi|       sau81|2003|     56|
|       Saudi|       sau81|2003|     56|
|       Saudi|       sau81|2003|     56|
|       China|        ch07|1999|     78|
|       India|        In01|2000|     90|
+------------+------------+----+-------+

In [ ]:
read_df.select('Value  ').orderBy('Value  ').show()

+-------+
|Value  |
+-------+
|     18|
|     34|
|     45|
|     56|
|     56|
|     56|
|     78|
|     90|
+-------+

In [ ]:
read_df.groupBy("Country Name").count().orderBy('count').show()
# GROUP BY FUNCTION TO COUNT HOW MANY TIMES A COUNTRY NAME APPEARED in ASEC order

+------------+-----+
|Country Name|count|
+------------+-----+
|         USA|    1|
|       Japan|    1|
|       India|    1|
|       China|    2|
|       Saudi|    3|
+------------+-----+

In [ ]:
from pyspark.sql.functions import *

In [ ]:
read_df.select(max("Value  "),'Country Name').show()
####### WANNA SHOW THE COUNTRY NAME WHO HAS THE MAXIMUM VALUE !!!!! ERROR ########

SyntaxError: invalid syntax. Perhaps you forgot a comma? (<ipython-input-28-9454982e1f52>, line 1)

In [ ]:
read_df.select(count('Country Name').alias('Count_Cont_Name')).show()
# COUNT THE NUMBER OF ENTRIES IN THE COLUMN NAME 'Country Name' WITH USING ALIAS

+---------------+
|Count_Cont_Name|
+---------------+
|              8|
+---------------+

In [ ]:
read_df.select(count('Country Name')).distinct().show()
########### WANNA SHOW THE COUNT OF DISTINCT ELEMENT ONLY !!!!!! ERROR ########

TypeError: 'Column' object is not callable

In [ ]:
read_df.select(avg('Value  ')).show()
# TO GET THE AVERAGE VALUE

+------------+
|avg(Value  )|
+------------+
|      54.125|
+------------+

In [ ]:
read_df.groupBy('Country Name').sum().show()
# USE GROUP BY TO PUT TOGETHER ALL THE SAME COUNTRY NAME AND ADDED THIER RESPECTIVE VALUES

+------------+---------+------------+
|Country Name|sum(Year)|sum(Value  )|
+------------+---------+------------+
|       India|     2000|          90|
|       China|     3598|         112|
|         USA|     2001|          18|
|       Saudi|     6009|         168|
|       Japan|     2005|          45|
+------------+---------+------------+

In [ ]:
read_df.withColumnRenamed("Country Name","Country").withColumnRenamed("Value  ","Value").show()
# WITHCOLUMNRENAMED fxn WILL RENAME THE COLUMN NAME, AND BY USING MULTIPLE WITHCOLUMNRENAMED WE CAN RENAME MULTIPLE COLUMN NAME

+-------+------------+----+-----+
|Country|Country Code|Year|Value|
+-------+------------+----+-----+
|  India|        In01|2000|   90|
|    USA|        US03|2001|   18|
|  China|        ch07|1999|   78|
|  Japan|       jap82|2005|   45|
|  Saudi|       sau81|2003|   56|
+-------+------------+----+-----+

In [ ]:
col_list = ['Cont Name','Cont Code','Year Cont Found','Value of Cont']
read_df.toDF(*col_list).show()
# RENAME MULTIPLE COLUMNS WITHOUT USING THE WITHCOLMNRENAMED FUNCTION
#toDF returns a new dataframe with the column names we passed

+---------+---------+---------------+-------------+
|Cont Name|Cont Code|Year Cont Found|Value of Cont|
+---------+---------+---------------+-------------+
|    India|     In01|           2000|           90|
|      USA|     US03|           2001|           18|
|    China|     ch07|           1999|           78|
|    Japan|    jap82|           2005|           45|
|    Saudi|    sau81|           2003|           56|
+---------+---------+---------------+-------------+

In [ ]:
rdd1 = sc.parallelize(tx.split())

In [ ]:
print(rdd1)

ParallelCollectionRDD[33] at readRDDFromFile at PythonRDD.scala:274

In [ ]:
rdd1.collect()

['He',
 'was',
 'aware',
 'there',
 'were',
 'numerous',
 'wonders',
 'of',
 'this',
 'world',
 'including',
 'the',
 'unexplained',
 'creations',
 'of',
 'humankind',
 'that',
 'showed',
 'the',
 'wonder',
 'of',
 'our',
 'ingenuity.',
 'There',
 'are',
 'huge',
 'heads',
 'on',
 'Easter',
 'Island.',
 'There',
 'are',
 'the',
 'Egyptian',
 'pyramids.',
 'There’s',
 'Stonehenge.',
 'But',
 'he',
 'now',
 'stood',
 'in',
 'front',
 'of',
 'a',
 'newly',
 'discovered',
 'monument',
 'that',
 'simply',
 "didn't",
 'make',
 'any',
 'sense',
 'and',
 'he',
 'wondered',
 'how',
 'he',
 'was',
 'ever',
 'going',
 'to',
 'be',
 'able',
 'to',
 'explain',
 'it.']

In [ ]:
rdd2 = rdd1.map(lambda x: (x,1))

In [ ]:
rdd2.collect()

[('He', 1),
 ('was', 1),
 ('aware', 1),
 ('there', 1),
 ('were', 1),
 ('numerous', 1),
 ('wonders', 1),
 ('of', 1),
 ('this', 1),
 ('world', 1),
 ('including', 1),
 ('the', 1),
 ('unexplained', 1),
 ('creations', 1),
 ('of', 1),
 ('humankind', 1),
 ('that', 1),
 ('showed', 1),
 ('the', 1),
 ('wonder', 1),
 ('of', 1),
 ('our', 1),
 ('ingenuity.', 1),
 ('There', 1),
 ('are', 1),
 ('huge', 1),
 ('heads', 1),
 ('on', 1),
 ('Easter', 1),
 ('Island.', 1),
 ('There', 1),
 ('are', 1),
 ('the', 1),
 ('Egyptian', 1),
 ('pyramids.', 1),
 ('There’s', 1),
 ('Stonehenge.', 1),
 ('But', 1),
 ('he', 1),
 ('now', 1),
 ('stood', 1),
 ('in', 1),
 ('front', 1),
 ('of', 1),
 ('a', 1),
 ('newly', 1),
 ('discovered', 1),
 ('monument', 1),
 ('that', 1),
 ('simply', 1),
 ("didn't", 1),
 ('make', 1),
 ('any', 1),
 ('sense', 1),
 ('and', 1),
 ('he', 1),
 ('wondered', 1),
 ('how', 1),
 ('he', 1),
 ('was', 1),
 ('ever', 1),
 ('going', 1),
 ('to', 1),
 ('be', 1),
 ('able', 1),
 ('to', 1),
 ('explain', 1),
 ('it.', 1)]

In [ ]:
rdd3 = rdd2.reduceByKey(lambda a,b:a+b)
rdd3.collect()

[('was', 2),
 ('there', 1),
 ('wonders', 1),
 ('of', 4),
 ('this', 1),
 ('world', 1),
 ('unexplained', 1),
 ('showed', 1),
 ('wonder', 1),
 ('are', 2),
 ('huge', 1),
 ('Easter', 1),
 ('Island.', 1),
 ('Egyptian', 1),
 ('There’s', 1),
 ('Stonehenge.', 1),
 ('But', 1),
 ('he', 3),
 ('now', 1),
 ('stood', 1),
 ('in', 1),
 ('newly', 1),
 ('monument', 1),
 ("didn't", 1),
 ('make', 1),
 ('ever', 1),
 ('able', 1),
 ('it.', 1),
 ('He', 1),
 ('aware', 1),
 ('were', 1),
 ('numerous', 1),
 ('including', 1),
 ('the', 3),
 ('creations', 1),
 ('humankind', 1),
 ('that', 2),
 ('our', 1),
 ('ingenuity.', 1),
 ('There', 2),
 ('heads', 1),
 ('on', 1),
 ('pyramids.', 1),
 ('front', 1),
 ('a', 1),
 ('discovered', 1),
 ('simply', 1),
 ('any', 1),
 ('sense', 1),
 ('and', 1),
 ('wondered', 1),
 ('how', 1),
 ('going', 1),
 ('to', 2),
 ('be', 1),
 ('explain', 1)]

In [ ]:
rdd5 = rdd3.map(lambda x: (x[1],x[0])).sortByKey()
rdd5.collect()

[(1, 'there'),
 (1, 'wonders'),
 (1, 'this'),
 (1, 'world'),
 (1, 'unexplained'),
 (1, 'showed'),
 (1, 'wonder'),
 (1, 'huge'),
 (1, 'Easter'),
 (1, 'Island.'),
 (1, 'Egyptian'),
 (1, 'There’s'),
 (1, 'Stonehenge.'),
 (1, 'But'),
 (1, 'now'),
 (1, 'stood'),
 (1, 'in'),
 (1, 'newly'),
 (1, 'monument'),
 (1, "didn't"),
 (1, 'make'),
 (1, 'ever'),
 (1, 'able'),
 (1, 'it.'),
 (1, 'He'),
 (1, 'aware'),
 (1, 'were'),
 (1, 'numerous'),
 (1, 'including'),
 (1, 'creations'),
 (1, 'humankind'),
 (1, 'our'),
 (1, 'ingenuity.'),
 (1, 'heads'),
 (1, 'on'),
 (1, 'pyramids.'),
 (1, 'front'),
 (1, 'a'),
 (1, 'discovered'),
 (1, 'simply'),
 (1, 'any'),
 (1, 'sense'),
 (1, 'and'),
 (1, 'wondered'),
 (1, 'how'),
 (1, 'going'),
 (1, 'be'),
 (1, 'explain'),
 (2, 'was'),
 (2, 'are'),
 (2, 'that'),
 (2, 'There'),
 (2, 'to'),
 (3, 'he'),
 (3, 'the'),
 (4, 'of')]

In [ ]:
rdd6 = rdd5.filter(lambda x: 'T' in x[1])
rdd6.collect()

[(1, 'There’s'), (2, 'There')]